Documents/УдалитьРассылка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УдалитьРассылка</Name>
			<Comment>Трейд Софт</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СостоянияПоАвтоинформированию</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыДействийДляСкоринга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныТекстаДляАвтоинформирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКИ</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейНаВыполнение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗаписьОтправителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиSMS4B</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсеДанныеЗаполнены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
								<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контакт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ХранилищеДанныхАвтоинформирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ХранилищеДанныхАвтоинформирования</Name>
			<Comment>Трейд Софт</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекстАвтоинформирования</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДополнительныеСведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ДополнительныеСведения</Name>
			<Comment>Трейд Софт</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВариантыДействийДляСкоринга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВариантыДействийДляСкоринга</Name>
			<Comment>Трейд Софт</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПроизвольноеДействие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SMSОповещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГолосовоеСообщение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EMailРассылка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапускБП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершениеБП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыЗначенийДляШаблонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ТипыЗначенийДляШаблонов</Name>
			<Comment>Трейд Софт</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Текст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реквизит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Файл</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Контрагент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Должник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредитор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыТипаСтрока.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыТипаСтрока</Name>
			<Comment>Трейд Софт</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Строка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПутьКФайлу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресФИАС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ШаблоныТекстаДляАвтоинформирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>ШаблоныТекстаДляАвтоинформирования</Name>
			<Comment>Трейд Софт</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ШаблонТекста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаПримереОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеШаблона</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыДействийДляСкоринга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонHTML</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныHTML</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокEMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбъектыУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомитьОДоставке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомитьОПрочтении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Настройка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Используется</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПоля</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыЗначенийДляШаблонов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗвуковыеФайлы</v8:Type>
								<v8:Type>cfg:CatalogRef.ФункцииТекстовыхШаблонов</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаДляПолученияЗначения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Хранилище</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодДопСвойства</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектДопСвойства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Функция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФункцииТекстовыхШаблонов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаХранилище</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрикрепляемыеФайлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Таблицы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Используется</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Функция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФункцииТекстовыхШаблонов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Колонки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Колонка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Функция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФункцииТекстовыхШаблонов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТипыПрикрепляемыхФайлов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыПрикрепляемыхФайлов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/УдалитьРассылка/Ext/ManagerModule.bsl
//Шаблон Автоинформирования
Процедура ЗаписатьФайлТСИ(ФайлТСИ, СсылкаНаДокумент) Экспорт
	Если ФайлТСИ.КоличествоСтрок() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	СсылкаСправочникаFTP = Константы.FTPСоединение.Получить();
	Если СсылкаСправочникаFTP.Пустая() Тогда
		ИмяФайла = СокрЛП(Константы.КаталогДляЗаданийАвтоинформирования.Получить());
	Иначе
		ИмяФайла = КаталогВременныхФайлов();
	КонецЕсли;
	Если Прав(ИмяФайла, 1) <> "\" Тогда
		ИмяФайла = ИмяФайла + "\";
	КонецЕсли;
	
	СтрокаДокумент = СтрЗаменить(Строка(СсылкаНаДокумент), ":", ".");
	ИмяФайла = ИмяФайла + "[" + Константы.ИмяИсточникаАИ.Получить() + "] " + СтрокаДокумент + ".tsi";
	Попытка
		ФайлТСИ.Записать(ИмяФайла);
	Исключение
		Сообщить("Не удалось записать файл """ + ИмяФайла + """");
		Возврат;
	КонецПопытки;
	
	Если НЕ СсылкаСправочникаFTP.Пустая() Тогда
		Попытка
			FTPПапка = Новый FTPСоединение(СсылкаСправочникаFTP.Сервер,,СсылкаСправочникаFTP.Пользователь,
					СсылкаСправочникаFTP.Пароль);			
		Исключение
			Сообщить("Не удалось установить FTP соединение!");
			Возврат;
		КонецПопытки;   
		FTPПапка.УстановитьТекущийКаталог(Константы.КаталогДляЗаданийАвтоинформирования.Получить());
		//УИД = Строка(Новый УникальныйИдентификатор());
		//FTPПапка.Записать(ИмяФайла, УИД + ".tsi");
		FTPПапка.Записать(ИмяФайла, "[" + Константы.ИмяИсточникаАИ.Получить() + "] " + СтрокаДокумент + ".tsi");
		УдалитьФайлы(ИмяФайла);
		//ИмяФайла = УИД + ".tsi";
		ИмяФайла = "[" + Константы.ИмяИсточникаАИ.Получить() + "] " + СтрокаДокумент + ".tsi";
  	КонецЕсли;

	//Добавить запись в регистр сведений
	Запись = РегистрыСведений.ХранилищеДанныхАвтоинформирования.СоздатьМенеджерЗаписи();
	Запись.Документ = СсылкаНаДокумент;
	Запись.ИмяФайла = ИмяФайла;
	Запись.ТекстАвтоинформирования = Новый ХранилищеЗначения(ФайлТСИ.ПолучитьТекст(), Новый СжатиеДанных(5));
	Запись.Записать();
КонецПроцедуры

//Шаблон Автоинформирования
Процедура ДобавитьЗаписьВФайлТСИ(ФайлТСИ, Объект, Шаблон, УИД, СпособИнформирования, ВидКИ, Отказ, ДатаАктуальности = ""
		) Экспорт
		
	Если СпособИнформирования = Перечисления.ВариантыДействийДляСкоринга.ГолосовоеСообщение ИЛИ
			СпособИнформирования = Перечисления.ВариантыДействийДляСкоринга.SMSОповещение Тогда	
		Текст = Шаблон.ШаблонТекста;
		Для Каждого Элемент Из Шаблон.Настройка Цикл
			Если Элемент.Используется Тогда
				Если Элемент.ТипПоля = ПредопределенноеЗначение("Перечисление.ТипыЗначенийДляШаблонов.Текст") Тогда
					СтрокаЗамены = Элемент.Значение;
					
				ИначеЕсли Элемент.ТипПоля = ПредопределенноеЗначение("Перечисление.ТипыЗначенийДляШаблонов.Реквизит") Тогда	
					
					//Массив = Элемент.Хранилище.Получить();
					Массив = УЭДСервер.ПолучитьМассивИзСтроки(Элемент.СтрокаХранилище);
					
					СтрокаЗамены = Справочники.ШаблоныТекстаДляАвтоинформирования.РазобратьСтроку(
							Элемент.СтрокаДляПолученияЗначения, Элемент.Значение, Объект, Массив);
							
				ИначеЕсли Элемент.ТипПоля = ПредопределенноеЗначение("Перечисление.ТипыЗначенийДляШаблонов.Файл") И 
						Не Элемент.Значение.Пустая() Тогда	
					СтрокаЗамены = "{" + Элемент.Значение.Путь + "}";			
				КонецЕсли;			
							
				Если Не Элемент.Функция.Пустая() Тогда
					СтрокаЗамены = Справочники.ШаблоныТекстаДляАвтоинформирования.ВычислитьФункцию(Элемент.Функция.Функция, 
							Объект, СтрокаЗамены);	
				КонецЕсли; 		
								
				Текст = СтрЗаменить(Текст, Элемент.Поле, СтрокаЗамены);
			КонецЕсли;
		КонецЦикла;
		Текст = СтрЗаменить(Текст, Символы.ПС, " ");
		Текст = СтрЗаменить(Текст, Символы.НПП, "");
	КонецЕсли;
	
	
	ТелефонАдрес = ПолучитьСтрокуТелефонАдрес(Объект, ВидКИ);
		
	
	Если СпособИнформирования = Перечисления.ВариантыДействийДляСкоринга.ГолосовоеСообщение Тогда
		ТелефонАдрес = ПодготовитьТелефон(ТелефонАдрес);
		Если ТелефонАдрес = "" Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;                  
		ФайлТСИ.ДобавитьСтроку(УИД + "~~" + ТелефонАдрес + "~1~2~0~1~~~" + ДатаАктуальности);
		ФайлТСИ.ДобавитьСтроку(Текст);
		
	ИначеЕсли СпособИнформирования = Перечисления.ВариантыДействийДляСкоринга.SMSОповещение Тогда
		ТелефонАдрес = ПодготовитьТелефон(ТелефонАдрес);
		Если ТелефонАдрес = "" Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
			
		Если СтрДлина(ТелефонАдрес) = 11 Тогда
			ТелефонАдрес = "7" + Сред(ТелефонАдрес, 2);
		КонецЕсли;
		ФайлТСИ.ДобавитьСтроку(УИД + "~~" + ТелефонАдрес + "~2~2~0~2~~~" + ДатаАктуальности);
		ФайлТСИ.ДобавитьСтроку(Текст);
		
	ИначеЕсли СпособИнформирования = Перечисления.ВариантыДействийДляСкоринга.EMailРассылка Тогда
		//Надо бы еще заголовок письма и важность
		//Поддержку форматирования ???	
		ТекстПисьма = Справочники.ШаблоныТекстаДляАвтоинформирования.ЗаполнитьHTMLШаблон(Шаблон, Объект);		
		ФайлТСИ.ДобавитьСтроку(УИД + "~~" + ТелефонАдрес + "~4~2~0~3~1~" + Шаблон.ЗаголовокEMail + "~" + ДатаАктуальности);
		СтрокаНомер = "<ТЕКСТ_ПИСЬМА = " + Формат(ФайлТСИ.КоличествоСтрок(), "ЧГ=") + ">";
		ФайлТСИ.ДобавитьСтроку(СтрокаНомер);
		ФайлТСИ.ДобавитьСтроку(ТекстПисьма);
		ФайлТСИ.ДобавитьСтроку(СтрокаНомер);
	КонецЕсли;
КонецПроцедуры

Функция ПодготовитьТелефон(Знач Телефон) Экспорт
	Номер = Найти(Телефон, ";");
	Если Номер > 0 Тогда
		Телефон = Лев(Телефон, Номер - 1);
	КонецЕсли;
	Телефон = СтрЗаменить(Телефон, "+", "");
	Телефон = СтрЗаменить(Телефон, "-", "");
	Телефон = СтрЗаменить(Телефон, " ", "");
	Телефон = СтрЗаменить(Телефон, "(", "");
	Телефон = СтрЗаменить(Телефон, ")", "");
	Возврат Телефон;
КонецФункции

Функция ПолучитьСтрокуТелефонАдрес(Объект, ВидКИ)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Таблица.Свойство
	                      |ПОМЕСТИТЬ ТаблицаСвойств
	                      |ИЗ
	                      |	&ТаблицаСвойств КАК Таблица
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	КонтрагентыДополнительныеРеквизиты.Значение,
	                      |	ВЫРАЗИТЬ(ТаблицаСвойств.Свойство КАК ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения).ВидСтроки КАК ВидСтроки
	                      |ИЗ
	                      |	Справочник.Контрагенты.ДополнительныеРеквизиты КАК КонтрагентыДополнительныеРеквизиты
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаСвойств КАК ТаблицаСвойств
	                      |		ПО (КонтрагентыДополнительныеРеквизиты.Ссылка В (&Объект))
	                      |			И КонтрагентыДополнительныеРеквизиты.Свойство = ТаблицаСвойств.Свойство
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ДополнительныеСведения.Значение,
	                      |	ВЫРАЗИТЬ(ТаблицаСвойств.Свойство КАК ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения).ВидСтроки
						  |ИЗ
	                      |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаСвойств КАК ТаблицаСвойств
	                      |		ПО (ДополнительныеСведения.Объект В (&Объект))
	                      |			И ДополнительныеСведения.Свойство = ТаблицаСвойств.Свойство
	                      |");
	Запрос.УстановитьПараметр("ТаблицаСвойств", ВидКИ.ТелефоныАдреса.Выгрузить());						  
	
	
	Если ТипЗнч(Объект) = Тип("СправочникСсылка.Контрагенты") Тогда
		Запрос.УстановитьПараметр("Объект", Объект);
				
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
   		Запрос.УстановитьПараметр("Объект", Объект.Контрагенты.Выгрузить().ВыгрузитьКолонку("Контрагент"));	
		
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.УслугиПоДоговору") Тогда
		Запрос.УстановитьПараметр("Объект", Объект.Контрагент);
		
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.ДолговыеОбязательства") Тогда
		Массив = Новый Массив();
		Для Каждого Элемент Из Объект.Контрагенты Цикл
			Если (ВидКИ.Должники И Элемент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Должник) ИЛИ
					(ВидКИ.Контрагенты И Элемент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Контрагент) ИЛИ
					(ВидКИ.Кредиторы И Элемент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Кредитор) Тогда
				Массив.Добавить(Элемент.Значение);
			КонецЕсли;			
		КонецЦикла;	
		
		Запрос.УстановитьПараметр("Объект", Массив);
				
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.ИсполнительныеДокументы") Тогда
		Массив = Новый Массив();
		Если ВидКИ.Должники Тогда
			Массив.Добавить(Объект.Должник);
		КонецЕсли;
		Если ВидКИ.Кредиторы Тогда 
		    Массив.Добавить(Объект.Взыскатель);
		КонецЕсли;	
		Если ВидКИ.Контрагенты Тогда
			Строки = Объект.Контрагенты.НайтиСтроки(Новый Структура("ВидКонтрагента", Перечисления.ВидыКонтрагентов.Контрагент));
			Для Каждого Элемент Из Строки Цикл
				Массив.Добавить(Элемент.Значение);			
			КонецЦикла;
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Объект", Массив);
		
	Иначе
		Возврат "";
	КонецЕсли;
	
	
	ТелефонАдрес = "";
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		Если Результат.ВидСтроки = Перечисления.ВидыТипаСтрока.Строка Тогда
			ТелефонАдрес = ТелефонАдрес + СокрЛП(Результат.Значение) + ";";
		Иначе	
			Номер = Найти(Результат.Значение, ";");
			Стр = Лев(Результат.Значение, Номер - 1);
			Номер = Найти(Стр, ",");
			Если Номер > 0 Тогда
				Стр = Лев(Стр, Номер - 1);
				ТелефонАдрес = ТелефонАдрес + СокрЛП(Стр) + ";";
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Возврат ТелефонАдрес;
КонецФункции
